{"cXs5md5wAq": {"paper_info": {"Primary Area": "applications to physical sciences (physics, chemistry, biology, etc.)", "Code Of Ethics": "I acknowledge that I and all co-authors of this work have read and commit to adhering to the ICLR Code of Ethics.", "Keywords": "graph neural networks, microbial communities, microbiology, genomes", "Submission Guidelines": "I certify that this submission complies with the submission instructions as described onhttps://iclr.cc/Conferences/2024/AuthorGuide.", "Abstract": "Understanding the interactions and interplay of microorganisms is a great challenge with many applications in medical and environmental settings. In this work, we model bacterial communities directly from their genomes using graph neural networks (GNNs). GNNs leverage the inductive bias induced by the set nature of bacteria, enforcing permutation invariance and granting combinatorial generalization. We propose to learn the dynamics implicitly by directly predicting community relative abundance profiles at steady state, thus escaping the need for growth curves. On two real-world datasets, we show for the first time generalization to unseen bacteria and different community structures. \nTo investigate the prediction results more deeply, we created a simulation for flexible data generation and analyze effects of bacteria interaction strength, community size, and training data amount.", "Anonymous Url": "I certify that there is no URL (e.g., github page) that could be used to find authors' identity.", "No Acknowledgement Section": "I certify that there is no acknowledgement section in this submission for double blind review.", "Submission Number": "9504", "PDF Url": "https://openreview.net/pdf?id=cXs5md5wAq"}, "review_info": [{"Heading": "Paper Decision", "Subheading": "DecisionbyProgram Chairs16 Jan 2024, 06:55 (modified: 16 Feb 2024, 15:43)EveryoneRevisions", "Content": "Decision:\nReject"}, {"Heading": "Meta Review of Submission9504 by Area Chair hyPi", "Subheading": "Meta ReviewbyArea Chair hyPi05 Dec 2023, 17:24 (modified: 16 Feb 2024, 15:31)EveryoneRevisions", "Content": "Metareview:\nThe paper studies bacterial communities by applying GNNs. All reviewers generally agreed that the area is interesting, but raised a bunch of questions about the methodology, the details, scalability, and more. Just as one example, it's not clear why a fully-connected graph makes sense here (in the absence of more specific knowledge on the community graph). While the authors provided some answers, ultimately there's enough outstanding questions and unclear items to make me believe the paper is still below the bar in the current iteration. However, I am optimistic about a future draft.\nJustification For Why Not Higher Score:\nLack of methodological clarity.\nJustification For Why Not Lower Score:\nN/A"}, {"Heading": "Common response", "Subheading": "Official CommentbyAuthors22 Nov 2023, 12:24Everyone", "Content": "Comment:\nWe thank the reviewers and program chairs for their time and feedback.\nWe appreciate that reviewers:\nunderlined the importance of modeling growth dynamics of microbial communities (reviewer\nkpxx\nand\naYM1\n) and its challenges (reviewer\naYM1\n);\nstressed our efforts to simulate data (reviewers\n5GQX\nand\nU7B8\n);\nagreed that GNNs are more suitable for this task than MLPs (reviewer\n5GQX\n,\naYM1\n, and\nU7B8\n),\nand appreciated our experiments to support our framework (reviewers\naYM1\nand\nU7B8\n).\nUsing the helpful comments from the reviewers, we edited the manuscript to improve the clarity and presentation (see changes in\ngreen\n). \nSome reviewer comments led to additional experiments, which we included in the manuscript in\nred\nand report in the answers below.\nWe start by answering common questions. Detailed answers are provided in the individual responses.\nThere was general confusion about the data (reviewers\n5GQX\n,\naYM1\n): datasets, i.e., Friedman2017, BaranwalClark2022, and each simulation set, were processed independently, meaning that a model was fitted on each but not on all at once. Hence, genome representations are distinct between real data (obtained from genome annotations) and simulated ones (resulting from our simulator). Genomes, i.e., node features, are always binary vectors. We edited the Method section to clarify this point.\nOne primary concern was the scalability of the method (reviewers\n5GQX\n,\naYM1\n). We have now conducted experiments that we report in Appendix B and figures S9 and S10 to analyze the effect of:\nlarger communities of up to 200 bacteria;\nthe training set size, i.e., the number of communities seen during training;\nthe diversity in the training set as a mean to improve generalization to unseen bacteria.\nIn addition, we enhanced our results by:\nIncreasing the number of model seeds from 3 to 5;\nPlotting the average $R^2$ with a 95% confidence interval across all samples calculated on sample bootstraps using the model ensemble (instead of plotting the $R^2$ per model seed and for the model ensemble);\nChanging the MPGNN node update function to match the C-SWM in [1].\nWe also show these changes in\nred\n.\nIf there are remaining issues or points to clarify, we would be happy to address them.\nReferences\n[1] Kipf, Thomas, Elise Van der Pol, and Max Welling. \"Contrastive learning of structured world models.\" ICLR (2020)."}, {"Heading": "Official Review of Submission9504 by Reviewer kpxx", "Subheading": "Official ReviewbyReviewer kpxx31 Oct 2023, 17:02 (modified: 10 Nov 2023, 12:26)EveryoneRevisions", "Content": "Summary:\nThe paper aims at predicting steady-state composition of microbial communities from the gene content of their genomes using graph neural networks.\nSoundness:\n2 fair\nPresentation:\n2 fair\nContribution:\n2 fair\nStrengths:\nUnderstanding how distinct bacteria form communities is an important problem, and the manuscript provides a solid introduction to the topic and, in the experimental section, asks important questions about our ability to understand community formation.\nWeaknesses:\nThe proposed approach for using GNNs for bacterial communities is vaguely described and not well justified. The key methods section (2.2) provides a generic description of existing GNN approaches, and is missing key microbiome specific information (in particular, what is the topology of the graph). That information is provided in Supplementary information: the graph is fully connected. This makes statements in the manuscript such as “By using k graph convolutional layers after one another we can achieve k-hop information propagation” rather misleading.\nOverall, the proposed method - applying GNN model in a straightforward way to a very small, fully-connected graph - is poorly justified and weak on novelty.\nQuestions:\nWhat is the rationale for using a GNN on a very simple graph?\nWhat is the benefit of focusing on predicting steady state, instead of focusing on dynamical changes to the relative abundances (e.g., dysbiosis).\nFlag For Ethics Review:\nNo ethics review needed.\nRating:\n3: reject, not good enough\nConfidence:\n4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.\nCode Of Conduct:\nYes", "Replies": [{"Heading": "Response to Reviewer kpxx (part 1/2): motivation to use GNN", "Subheading": "Official CommentbyAuthors15 Nov 2023, 03:37 (modified: 15 Nov 2023, 03:48)EveryoneRevisions", "Content": "Comment:\nThanks a lot for your time and feedback. We understand our motivation to use GNNs needs to be clarified and we would like to provide some first answers.\nWe employ GNNs as a predictive model for microbial systems. Note that this differs from some benchmarks in the GNN literature [1-2], where the goal is to perform e.g. node classification with large graphs with known connectivity as input data.\nWe are interested in using the GNN as a dynamics model, where we cannot assume any prior knowledge on the graph connectivity.  Our view of GNNs as dynamics models is similar to the works [3-5]. In all these cases, the graphs are small (3-10 nodes), but still, they benefit from the injection of relational and entity-centric inductive biases via the graph structure, as it offers isolation of information that monolithic networks don’t have [6].\nGNNs offer the advantage of sharing parameters across nodes - treating input genomes as a bag of units rather than 1 concatenated vector, which is key to generalizing to any unseen bacteria and communities of any size. Any new genome can thus be treated by the GNN for predictions without needing to resize the model. Whether the bacterial community is small or big is an external characteristic which does not influence the choice of architecture for this task.\nAs rightly pointed out, we do not know the graph topology. It is where GNNs become handy as we can use fully connected graphs that do not make any assumptions about the network. The message passing and/or convolutional layers allow updating nodes based on all members of the community, which is reasonable as all members may affect each other (directly or indirectly [7-8]). The k-hop information propagation should capture k-order relations between entities: the first message passing is limited to the neighboring node attributes (pairwise interactions) and the next ones propagate the interactions of neighbors (bacterium $n_i$ receives information from $n_j$ and how it has been affected by others).\nWe hope these points answer your concerns and that our motivation to use GNN is now more comprehensible; we will edit our manuscript accordingly. Besides, we will answer your 2nd question in the coming days.\nReferences\n[1] Sen, Prithviraj, et al. \"Collective classification in network data.\" AI magazine 29.3 (2008): 93-93.\n[2] Pei, Hongbin, et al. \"Geom-gcn: Geometric graph convolutional networks.\" arXiv preprint arXiv:2002.05287 (2020).\n[3] Sanchez-Gonzalez, Alvaro, et al. \"Graph networks as learnable physics engines for inference and control.\" International Conference on Machine Learning. PMLR, 2018.\n[4] Kipf, Thomas, Elise Van der Pol, and Max Welling. \"Contrastive learning of structured world models.\" arXiv preprint arXiv:1911.12247 (2019).\n[5] Watters, Nicholas, et al. \"Visual interaction networks: Learning a physics simulator from video.\" Advances in neural information processing systems 30 (2017).\n[6] Battaglia, Peter W., et al. \"Relational inductive biases, deep learning, and graph networks.\" arXiv preprint arXiv:1806.01261 (2018).\n[7] Pacheco, Alan R., Melisa L. Osborne, and Daniel Segrè. \"Non-additive microbial community responses to environmental complexity.\" Nature communications 12.1 (2021): 2365.\n[8] Morin, Manon A., et al. \"Higher-order interactions shape microbial interactions as microbial community complexity increases.\" Scientific Reports 12.1 (2022): 22640."}, {"Heading": "Response to Reviewer kpxx (part 2/2)", "Subheading": "Official CommentbyAuthors22 Nov 2023, 12:26Everyone", "Content": "Comment:\nWe thank you again for your feedback. Below is the rest of our response to your concerns and questions. In addition, please check our general response.\nQ1\nPlease, see the 1st part of the response. \nWe modified a) our motivation to use GNNs in the Introduction, b) the description of the network topology in the Methods.\nQ2\nWe agree that predicting growth dynamics may be ideal for apprehending bacterial community assembly and interactions. However, in practice, datasets usually contain 1 time point per sample due to time and resource costs. Therefore, approaching the problem via steady-states allows a potential application to many more datasets and applications.\nRegarding modeling the dynamics, we argue that directly predicting the quantity of interest in an end-to-end fashion has proven generally more efficient than using intermediates in machine learning. Hence, while our framework could be employed for modeling dynamics recursively, e.g., as in [1-2], it may not necessarily be better.\nFinally, understanding dysbiosis events is essential for human health. As of note, dysbiosis is a disruption of the microbiota from a healthy state [3]. Accordingly, dysbiosis can be studied from steady-state data by comparing healthy and diseased samples and does not require a dynamic model.\nReferences\n[1] Michel-Mata, Sebastian, et al. \"Predicting microbiome compositions from species assemblages through deep learning. iMeta 1: e3.\" (2022).\n[2] Baranwal, Mayank, et al. \"Recurrent neural networks enable design of multifunctional synthetic human gut microbiome dynamics.\" Elife 11 (2022): e73870.\n[3] Kriss, Michael, et al. \"Low diversity gut microbiota dysbiosis: drivers, functional implications and recovery.\" Current opinion in microbiology 44 (2018): 34-40."}]}, {"Heading": "Official Review of Submission9504 by Reviewer 5GQX", "Subheading": "Official ReviewbyReviewer 5GQX30 Oct 2023, 17:43 (modified: 10 Nov 2023, 12:26)EveryoneRevisions", "Content": "Summary:\nThe paper tested the idea of using MPGNN or GraphSAGE to learn generalizable microbial community steady-state dynamics. The proposed models were tested on  simulated and previous publicly available microbial datasets and compared with the MLP-based implementation to show the effectiveness, with the discussions on the generalizability of GNN-based implementations.\nSoundness:\n2 fair\nPresentation:\n2 fair\nContribution:\n2 fair\nStrengths:\nThe presented comparison results with MLP-based implementation demonstrates the potential of GNN-based implementations to model microbial community dynamics.\nWeaknesses:\nThe methodological contribution is limited as the presented work is mostly implementing GNNs for microbial steady state predictions.\nThe main core of the paper is based on the assumption that if there is a steady state solution to the dynamics of bacterial species, then that steady state can be predicted using the genome data of the species in the system. This is a reasonable assumption to make. However the fact that this method works only for steady state solutions needs to be emphasized. Indeed in the GLV setting in the famous example of foxes and rabbits, there could be steady state and oscillatory solutions even though the participating genomes are foxes and rabbits in both the cases. It might also be a good idea to highlight why authors expect to find (or not) only steady state solutions in systems involving microorganisms such as bacteria. This will add more strength to the paper.\nFor simulations, the GLV equations along with initial conditions and parameters $\\mu_i, K_i, a_{i,j}$ drawn from different probability density functions are used to generate data. Did all such simulations lead to steady state solutions? Were any simulations that did not lead to steady state solutions discarded? Do the authors also have any comments on the frequency of steady state solutions when random parameters are used?\nGiven the GLV equations, the steady state solutions can be found by solving a system of $|S|$ linear algebraic equations:\n \\begin{equation}\n \\sum_{j=1}^{|S|}a_{i,j}n_j = K_i.\n \\end{equation}\nThe steady state is entirely determined by the parameters $a_{i,j}$ and $K_i$. The authors use a vector composed of $[\\mu_i, K_i, \\nu_i^s, \\nu_i^r, random]$ (where $a_{i,j} \\approx \\nu_i^s. \\nu_j^r$) to simulate the genome data in their simulation. It would be a good idea to highlight that within the simulated genome vector only the components $[K_i, \\nu_i^s, \\nu_i^r]$ determine the steady state solution.\nThe parameter $a_{i,j}$ (broken into two vectors $\\nu_i^s, \\nu_j^r$ to simulate the genome) contains information on the pairwise interaction between different species. On the other hand, the information in a genome is completely intrinsic to a particular species. The authors should square these two facts.\nA proper simulation would entail simulation of the genome data. The genome data typically do not include information on interaction between species. But for simulations, the interaction matrix was used to derive $\\nu$ vectors. The claim of interpretability seems to be questionable.\nThe authors appear to be confused on equivariance and invariance. The permutation invariance justification for using graph neural networks is confusing. For example, GLV models are widely used to model the dynamics of microorganisms. But the GLV model is not permutation invariant. The authors stated \"\\textit{When shuffling the order of bacteria within the train and test communities, the accuracy of MLPs drops significantly, clearly showing that the dynamics learned by MLPs are not invariant to permutations...}\" It is to be expected that shuffling the data will lead to reduction in performance of MLP based models. But as long as all the training and testing is done with a particular order of species, it should not matter.\nThe authors need to provide details on how the node (genome) attributes were obtained, especially $\\nu$'s, as in real-world data, the ground-truth interaction $a_{ij}$ is not available.\nQuestions:\nHow the nodes, edges and their associated attributes/features were constructed, especially based on the real-world data?\nHow scalable is the GNN-based implementation with respect to the number of microbial species?\nFlag For Ethics Review:\nNo ethics review needed.\nRating:\n3: reject, not good enough\nConfidence:\n3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.\nCode Of Conduct:\nYes", "Replies": [{"Heading": "Response to Reviewer 5GQX", "Subheading": "Official CommentbyAuthors22 Nov 2023, 12:27Everyone", "Content": "Comment:\nThank you very much for thoroughly evaluating our work, especially on the simulation section. Your comments are much appreciated and highlight points we must clarify in the manuscript. Below, we answer the weakness points (W#) and questions (Q#).\nW1\nThe vast majority of datasets consist of a unique time point per sample. Hence, there is a trade-off between waiting for more growth dynamics and utilizing the data we already have. While efforts are made in the lab to enhance datasets with high-throughput methods (e.g., sample miniaturization and automation of data acquisition), progress on the data analysis side may also be made to fit the data type better. We, as well, would prefer working with growth curves, but these datasets are simply too few and showcase too small communities. Hence, we propose an alternative to focus on steady states, with more datasets and applications. Also, microbiota can be hypothesized to be in pseudo-stable states, as they generally show low variability across time except for big environmental perturbations [1].\nW2-3\nYou are entirely right: not all simulated communities necessarily lead to a steady state; we would discard suicidal and non-stable communities, i.e. keep communities if $\\sum_{i \\in |S|} n_i > 0$ and $\\frac{dn_i}{dt} < 10^{-3} ; \\forall i \\in |S|$, with $|S|$ the number of bacteria in the community. In practice, for our set of parameters, all simulated communities were already stable, hence we did not need to resort to discarding any. This is now included in the Methods section 2.4.\nFinally, we do not expect to find only steady states in nature as multi-stability and environmental fluctuations may vary the observed states of communities [2]; this is a limitation of our current proposal. A potential improvement would be predicting each species' probability distribution (e.g., mean and variance of a Gaussian distribution) and/or predicting several values. Unfortunately, we could not implement these with our datasets due to the lack of samples to estimate variance and due to very few cases of multi-stability.\nW4\nWe updated the Methods accordingly.\nW5-6\nIn our simulations, the interaction matrix $M$ determines the evolution of the community. In principle, this matrix is an unknown function of the genome of different bacterial species. Therefore, while we can define an interesting distribution over interaction matrices, it is extremely challenging to define a distribution over genomes such that this gives rise to a reasonable distribution of interaction matrices. For this reason, we are forced to take an inverse approach to control $M$: we sample interaction matrices, assume a particular form for the function mapping genomes to interactions, and optimize the genome of simulated bacteria to produce the desired interaction matrix. This allows us to indirectly sample from a distribution of genomes such that a function from genomes to the interaction matrix is guaranteed to exist, and the resulting interaction matrix is interesting.\nWe carefully reviewed our manuscript and did not come across any mention of interpretability for the simulated genomes. Our suggestion for interpreting GNNs and genomes in future work pertains to real data. If there is any confusion, please point it out so we can make appropriate edits.\nW7\nThank you for pointing this out; we corrected\ninvariance\nfor\nequivariance\nin the manuscript.\nW8, Q1\nSee the common response; we clarified the Methods. We only use node attributes (the genomes) and, given the lack of prior knowledge on bacterial interactions, we do not use edge attributes and we use a fully connected graph.\nQ2\nSee the common response; we added experiments to quantify the scalability of our method, shown in Appendix B.1 and and S10. \nOur new results demonstrate that our approach can scale to large communities of up to 200 bacteria (Supplementary Fig. S9). \nWe also show that given a large number of samples, GNNs’ performance on unseen bacteria increases with the diversity of bacteria seen during training Supplementary Fig. S10). Hence, we believe our method will become increasingly useful with larger-scale datasets.\nReferences\n[1] Lozupone, Catherine A., et al. \"Diversity, stability and resilience of the human gut microbiota.\" Nature 489.7415 (2012): 220-230.\n[2] Gonze, Didier, et al. \"Multi-stability and the origin of microbial community types.\" The ISME journal 11.10 (2017): 2159-2166."}]}, {"Heading": "Official Review of Submission9504 by Reviewer aYM1", "Subheading": "Official ReviewbyReviewer aYM129 Oct 2023, 16:32 (modified: 10 Nov 2023, 12:26)EveryoneRevisions", "Content": "Summary:\nThe paper looks at modeling bacterial communities and their interactions using graph neural networks (GNNs). They rely on two open datasets, total n = 552 samples. The authors have downloaded genomes for the bacteria that was converted to growth encodings. To address the issue with limited data the authors also used a simulator based on the Lotka-Volterra model. They compare three different models, MLP as the standard, GNNs and MPGNN. Using GNN/MPGNN the authors were able to model but the models were sensitive to variations and generalizing to larger systems was poor. Models were better than MLP but only marginally.\nSoundness:\n3 good\nPresentation:\n2 fair\nContribution:\n1 poor\nStrengths:\nI found the paper interesting and I think the authors are correct that a better modeling of bacteria would open up a much better understanding of a wide range of fields. Key strengths:\nThe authors' comparative approach between models is commendable.\nThe paper addresses a clinically relevant topic, shedding light on bacterial interactions.\nThe authors' transparency regarding the challenges in scaling the mod\nWeaknesses:\nWhile I enjoyed reading something on the outskirts of my experience, although I have grown my own tuberculosis communities in the early days of my research, I struggle with some of the basic premises:\nMotivation & Context: The paper's motivation needs clearer alignment with real-world applications. The authors cite that understanding these communities is essential for gut, industry and space but I find the step from this paper to extrapolating to gut seems huge. The largest studied communities are 26 and this needs to be put in context with the other fields, citing Wikipedia “1010 to 1011 cells per gram of intestinal content” seems far off from the estimated single colonies. The types of bacteria should also be matched with the environment that you aim to generalize for.\nSample Size & DNA Inclusion: I'm concerned about the limited independent samples, especially in combination with the attempt to include DNA. Making sense of DNA has proven much more difficult than thought of in the beginning and I’m not convinced that the addition made sense. Adding it to the paper risks of overfitting the data even more. I wonder if the field wouldn’t benefit more from going from 500 samples to 1-2000 more than this paper. My experience with building models on this type of data is that they are frustratingly brittle due to the lack of data.\nClarity & Explanation: Coming from medicin to ML is always a challenge. It would be helpful if the paper could provide clearer explanations for terms and metrics, especially for readers transitioning from medical backgrounds. E.g. keystone bacteria are not explained, good vs acceptable R2 is unclear to the reader (I can’t even find clearly how is this calculated, despite looking in appendix A which I should not have to for the main outcome), I assume that R2 is highly dependent on the underlying complexity, also the datasets have completely different bacteria suggesting that their purpose was different but this is unclear to me despite reading it several times.\nSimulation Impact: The paper should provide a clearer explanation of the effect of simulated colonies on the models' stability.\nRegarding the conclusion I’m a little confused as to why it doesn’t recommend including more data. I believe the authors have devoted significant time to this paper and before we put others down this path, perhaps we should wait for more data or do the authors truly feel that GEMs will be the solution?\nQuestions:\nSee weaknesses.\nMy main question is if it is true that the lack of data was your biggest challenge? And if so I would like to have it clearly stated so that others may look for additional data sources or make their own datasets available before we dive into new models.\nFlag For Ethics Review:\nNo ethics review needed.\nRating:\n6: marginally above the acceptance threshold\nConfidence:\n3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.\nCode Of Conduct:\nYes", "Replies": [{"Heading": "Response to Reviewer aYM1", "Subheading": "Official CommentbyAuthors22 Nov 2023, 12:29Everyone", "Content": "Comment:\nThank you very much for your feedback. Hopefully, this work will also be useful to investigate microbial communities within which\nMycobacterium tuberculosis\ngrows!\nMotivation & Context\nWe refer the reviewer to the common response: we have added an experiment on simulated data to evaluate the scalability of the method. Regarding the type of bacteria and environment, we do not aim for particular microbiota: Friedman2017 showcases soil bacteria and BaranwalClark2022, gut bacteria. In general, our framework could be applied to any microbiota.\nSample Size & DNA Inclusion\nHere, the inclusion of DNA allows us to generalize by its universality, as we treat it as a global feature space. It is the only set of features we learn from and, as shown in the results, enables predicting unseen bacteria to a certain extent.\nWe agree that the lack of data entails good performance, as shown in the new experiments in Appendix B and Supplementary Fig. S9. Our new results clearly highlight that, especially for large, complex communities, models benefit from more samples at training time. They also demonstrate that our approach can scale to large communities of up to 200 bacteria. Finally, we also show in Appendix B and Supplementary Fig. S10, that given a large number of samples, GNNs’ performance on unseen bacteria increases with the diversity of bacteria seen during training. Hence, we believe our method will become increasingly useful with larger-scale datasets.\nClarity & Explanation\n$R^2$: We have now detailed $R^2$ in the Methods of the main text. $R^2$ measures the deviation from a given model to a random one that would predict an average value. Hence, it is independent of the underlying complexity.\nDatasets: please, see the common response.\nKeystone bacteria: we have changed the wording in the text. A keystone bacterium is a bacterium that drives community assembly; they are identified from data showing that their presence or removal dramatically affects the community composition [1].\nSimulation Impact & Question\nFirstly, we have improved clarity on the fact that models were fitted to datasets independently -- please, see the common response.\nThe simulations are intended to study the properties of the prediction pipeline. We have now developed this further by investigating scaling and diversity aspects. We added this to Appendix B and discussed it in Section 3.4; see also answer to\nSample Size & DNA Inclusion.\nWe do not intend to suggest that more data is not beneficial: our experiments on simulated data show an increase in model accuracy when trained on more communities sampled from a given set of bacterial species, as discussed in Appendix B.1 and shown in Supplementary Fig. S9. In this particular setting, we observe that accuracy plateaus once a sufficient number of communities is observed. \nGiven the jump in complexity of communities when increasing community sizes (in this case the number of bacteria species in the network), we see an overall decrease in performance as overfitting with smaller communities and lower generalization for larger ones is observed.\nWhen it comes to generalizing to unseen bacteria, we also argue that increasing the number of samples improves predictions to a certain extent but is limited. However, increasing the diversity of bacteria seen during training enables further improving the accuracy as shown in Supplementary Fig. S10.\nOur opinion is that we, as bioinformaticians and computer scientists, should tackle biological challenges with the data that is currently available. While efforts are made in the lab to enhance datasets with high-throughput methods (e.g., sample miniaturization and automation of data acquisition), we make progress on the data analysis side. The datasets that will appear on this topic soon, will still not be big enough to satisfy large-scale deep learning machinery, so we believe our method is timely and at the right scale.\nReferences\n[1] Banerjee, Samiran, Klaus Schlaeppi, and Marcel GA van der Heijden. \"Keystone taxa as drivers of microbiome structure and functioning.\" Nature Reviews Microbiology 16.9 (2018): 567-576."}]}, {"Heading": "Official Review of Submission9504 by Reviewer U7B8", "Subheading": "Official ReviewbyReviewer U7B823 Oct 2023, 01:17 (modified: 10 Nov 2023, 12:26)EveryoneRevisions", "Content": "Summary:\nThe study focuses on understanding the interactions between microorganisms, which is of significant importance in both medical and environmental contexts. The authors introduce a novel approach by modeling bacterial communities using graph neural networks (GNNs) directly from the genomes of the bacteria. The inherent properties of GNNs, such as permutation invariance, allow them to effectively capture the relationships within the bacterial set, thus offering combinatorial generalization.\nSoundness:\n3 good\nPresentation:\n4 excellent\nContribution:\n3 good\nStrengths:\nNovel problem setup and the first use of GNN to tackle this problem.\nThe use of GNN matches with the data well since it is modeling a dynamic system.\nVery interesting set of experiments and they are extensive.\nThe presentation is nice and clear.\nNice simulation data construction and results.\nWeaknesses:\nMethodological novelty is limited since it is basically fitting a GNN on a bacterial community graph. This is not to say the novelty of the paper is limited. Since I do believe it is tackling an interesting new problem with impact. I would suggest the authors consider a journal paper instead.\nQuestions:\nWhere are the circles for fig3A (models not on permuted data)? Why only select some of the combinations and not showing all of them? It would also be great if the authors could compare with standard practice of this task instead of just comparing with GraphSAGE. For example, by fitting the mechanistic model.\nHave the authors experimented with other GNN models? Since graphsage is only one instantiation and there are many recent ones with more expressive powers.\nModeling the dynamics sounds interesting. Could the authors also use GNN in an iterative way to model the dynamics? For example, using ideas from this paper:\nhttp://proceedings.mlr.press/v119/sanchez-gonzalez20a.html\nFlag For Ethics Review:\nNo ethics review needed.\nRating:\n6: marginally above the acceptance threshold\nConfidence:\n3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.\nCode Of Conduct:\nYes", "Replies": [{"Heading": "Response to Reviewer U7B8", "Subheading": "Official CommentbyAuthors22 Nov 2023, 12:31Everyone", "Content": "Comment:\nThank you for your positive evaluation of our work and feedback.\nFig3A\nThey are now shown as the average performance of the ensemble model across the 5 cross-validation sets is shown together with the 95% confidence interval. We have homogenized the figures now to show the average and the 95% confidence interval.\nCombinations\nWe have now included the MLP architecture in all experiments for more homogeneity in the manuscript, we hope this clarifies the reviewer's concern.\nOther architectures\nAs per the reviewer’s suggestion, we have now tested the improved graph attention architecture (GATv2) [1] (original version GAT in [2]), and the improved graph convolution from [3] (GCNII), (original version GCN in [4]). Unfortunately, they failed to fit the Friedman2017data (see Table below). We added results in Appendix A and Supplementary Table S3.\nTable:\nAccuracy of models implemented with the GATv2 [2] and GCNII [4] architectures on real microbial community data. For each dataset, five seeds per model were used and models fitted on five cross-validation folds. The average coefficient of determination ($R^2$) of the ensemble models, with a 95% confidence interval, was calculated on 100 bootstraps of test samples.\nDataset\nArchitecture\nTest average $R^2$\n95 % confidence interval\nFriedman2017\nGCNII\n0.0618\n[-0.1410, 0.2822]\nFriedman2017\nGATv2\n0.0279\n[-0.0808, 0.1266]\nFriedman2017\nMPGNN\n0.808809\n[0.677719, 0.894381]\nBaranwalClark2022\nGCNII\n0.7090\n[0.5498, 0.827654]\nBaranwalClark2022\nGATv2\n0.3568\n[0.2455, 0.4711]\nBaranwalClark2022\nMPGNN\n0.762534\n[0.665613, 0.844525]\nThese architectures do not seem to be particularly suitable for our task, as even with hyperparameter optimization, we could not get good performances on both datasets.\nDynamics\nWe agree that explicitly predicting growth dynamics may be ideal for apprehending bacterial community assembly and interactions. In practice, the GNN models we propose can be repurposed for this task, and densely predict the state of the community at arbitrary timesteps. It is also possible to enhance the model by using e.g. recurrent GNN. A challenge is that datasets usually contain one time point per sample due to time and resource costs. Therefore, while this approach would be possible for a few datasets, e.g., as in [5-6], it could not be extended to more.\nReferences\n[1] Brody, Shaked, Uri Alon, and Eran Yahav. \"How attentive are graph attention networks?.\" arXiv preprint arXiv:2105.14491 (2021).\n[2] Veličković, Petar, et al. \"Graph attention networks.\" arXiv preprint arXiv:1710.10903 (2017).\n[3] Chen, Ming, et al. \"Simple and deep graph convolutional networks.\" International conference on machine learning. PMLR, 2020.\n[4] Kipf, Thomas N., and Max Welling. \"Semi-supervised classification with graph convolutional networks.\" arXiv preprint arXiv:1609.02907 (2016).\n[5] Michel-Mata, Sebastian, et al. \"Predicting microbiome compositions from species assemblages through deep learning. iMeta 1: e3.\" (2022).\n[6] Baranwal, Mayank, et al. \"Recurrent neural networks enable design of multifunctional synthetic human gut microbiome dynamics.\" Elife 11 (2022): e73870."}]}]}}